from .custom import translations as custom_translations


"""
uk locale file.

It has been generated automatically and must not be modified directly.
"""


locale = {
    'plural': lambda n: 'few' if (((0 == 0 and ((0 == 0))) and ((n % 10) == (n % 10) and (((n % 10) >= 2 and (n % 10) <= 4)))) and (not ((n % 100) == (n % 100) and (((n % 100) >= 12 and (n % 100) <= 14))))) else 'many' if ((((0 == 0 and ((0 == 0))) and ((n % 10) == (n % 10) and (((n % 10) == 0)))) or ((0 == 0 and ((0 == 0))) and ((n % 10) == (n % 10) and (((n % 10) >= 5 and (n % 10) <= 9))))) or ((0 == 0 and ((0 == 0))) and ((n % 100) == (n % 100) and (((n % 100) >= 11 and (n % 100) <= 14))))) else 'one' if (((0 == 0 and ((0 == 0))) and ((n % 10) == (n % 10) and (((n % 10) == 1)))) and (not ((n % 100) == (n % 100) and (((n % 100) == 11))))) else 'other',
    'ordinal': lambda n: 'few' if (((n % 10) == (n % 10) and (((n % 10) == 3))) and (not ((n % 100) == (n % 100) and (((n % 100) == 13))))) else 'other',
    'translations': {
        'days': {
            'abbreviated': {
                0: 'пн',
                1: 'вт',
                2: 'ср',
                3: 'чт',
                4: 'пт',
                5: 'сб',
                6: 'нд',
            },
            'narrow': {
                0: 'П',
                1: 'В',
                2: 'С',
                3: 'Ч',
                4: 'П',
                5: 'С',
                6: 'Н',
            },
            'short': {
                0: 'пн',
                1: 'вт',
                2: 'ср',
                3: 'чт',
                4: 'пт',
                5: 'сб',
                6: 'нд',
            },
            'wide': {
                0: 'понеділок',
                1: 'вівторок',
                2: 'середу',
                3: 'четвер',
                4: 'пʼятницю',
                5: 'суботу',
                6: 'неділю',
            },
        },
        'months': {
            'abbreviated': {
                1: 'січ.',
                2: 'лют.',
                3: 'бер.',
                4: 'квіт.',
                5: 'трав.',
                6: 'черв.',
                7: 'лип.',
                8: 'серп.',
                9: 'вер.',
                10: 'жовт.',
                11: 'лист.',
                12: 'груд.',
            },
            'narrow': {
                1: 'с',
                2: 'л',
                3: 'б',
                4: 'к',
                5: 'т',
                6: 'ч',
                7: 'л',
                8: 'с',
                9: 'в',
                10: 'ж',
                11: 'л',
                12: 'г',
            },
            'wide': {
                1: 'січня',
                2: 'лютого',
                3: 'березня',
                4: 'квітня',
                5: 'травня',
                6: 'червня',
                7: 'липня',
                8: 'серпня',
                9: 'вересня',
                10: 'жовтня',
                11: 'листопада',
                12: 'грудня',
            },
        },
        'units': {
            'year': {
                'one': '{0} рік',
                'few': '{0} роки',
                'many': '{0} років',
                'other': '{0} року',
            },
            'month': {
                'one': '{0} місяць',
                'few': '{0} місяці',
                'many': '{0} місяців',
                'other': '{0} місяця',
            },
            'week': {
                'one': '{0} тиждень',
                'few': '{0} тижні',
                'many': '{0} тижнів',
                'other': '{0} тижня',
            },
            'day': {
                'one': '{0} день',
                'few': '{0} дні',
                'many': '{0} днів',
                'other': '{0} дня',
            },
            'hour': {
                'one': '{0} година',
                'few': '{0} години',
                'many': '{0} годин',
                'other': '{0} години',
            },
            'minute': {
                'one': '{0} хвилина',
                'few': '{0} хвилини',
                'many': '{0} хвилин',
                'other': '{0} хвилини',
            },
            'second': {
                'one': '{0} секунда',
                'few': '{0} секунди',
                'many': '{0} секунд',
                'other': '{0} секунди',
            },
            'microsecond': {
                'one': '{0} мікросекунда',
                'few': '{0} мікросекунди',
                'many': '{0} мікросекунд',
                'other': '{0} мікросекунди',
            },
        },
        'relative': {
            'year': {
                'future': {
                    'other': 'через {0} року',
                    'one': 'через {0} рік',
                    'few': 'через {0} роки',
                    'many': 'через {0} років',
                },
                'past': {
                    'other': '{0} року тому',
                    'one': '{0} рік тому',
                    'few': '{0} роки тому',
                    'many': '{0} років тому',
                },
            },
            'month': {
                'future': {
                    'other': 'через {0} місяця',
                    'one': 'через {0} місяць',
                    'few': 'через {0} місяці',
                    'many': 'через {0} місяців',
                },
                'past': {
                    'other': '{0} місяця тому',
                    'one': '{0} місяць тому',
                    'few': '{0} місяці тому',
                    'many': '{0} місяців тому',
                },
            },
            'week': {
                'future': {
                    'other': 'через {0} тижня',
                    'one': 'через {0} тиждень',
                    'few': 'через {0} тижні',
                    'many': 'через {0} тижнів',
                },
                'past': {
                    'other': '{0} тижня тому',
                    'one': '{0} тиждень тому',
                    'few': '{0} тижні тому',
                    'many': '{0} тижнів тому',
                },
            },
            'day': {
                'future': {
                    'other': 'через {0} дня',
                    'one': 'через {0} день',
                    'few': 'через {0} дні',
                    'many': 'через {0} днів',
                },
                'past': {
                    'other': '{0} дня тому',
                    'one': '{0} день тому',
                    'few': '{0} дні тому',
                    'many': '{0} днів тому',
                },
            },
            'hour': {
                'future': {
                    'other': 'через {0} години',
                    'one': 'через {0} годину',
                    'few': 'через {0} години',
                    'many': 'через {0} годин',
                },
                'past': {
                    'other': '{0} години тому',
                    'one': '{0} годину тому',
                    'few': '{0} години тому',
                    'many': '{0} годин тому',
                },
            },
            'minute': {
                'future': {
                    'other': 'через {0} хвилини',
                    'one': 'через {0} хвилину',
                    'few': 'через {0} хвилини',
                    'many': 'через {0} хвилин',
                },
                'past': {
                    'other': '{0} хвилини тому',
                    'one': '{0} хвилину тому',
                    'few': '{0} хвилини тому',
                    'many': '{0} хвилин тому',
                },
            },
            'second': {
                'future': {
                    'other': 'через {0} секунди',
                    'one': 'через {0} секунду',
                    'few': 'через {0} секунди',
                    'many': 'через {0} секунд',
                },
                'past': {
                    'other': '{0} секунди тому',
                    'one': '{0} секунду тому',
                    'few': '{0} секунди тому',
                    'many': '{0} секунд тому',
                },
            },
        },
        'day_periods': {
        },
        'week_data': {
            'min_days': 1,
            'first_day': 0,
            'weekend_start': 5,
            'weekend_end': 6,
        },
    },
    'custom': custom_translations
}
