from pendulum.locales.gu.custom import translations as custom_translations


"""
gu locale file.

It has been generated automatically and must not be modified directly.
"""


locale = {
    'plural': lambda n: 'one' if ((n == n and ((n == 0))) or (n == n and ((n == 1)))) else 'other',
    'ordinal': lambda n: 'one',
    'translations': {
        'days': {
            'abbreviated': {
                0: 'સોમ',
                1: 'મંગળ',
                2: 'બુધ',
                3: 'ગુરુ',
                4: 'શુક્ર',
                5: 'શનિ',
                6: 'રવિ',
            },
            'narrow': {
                0: 'સો',
                1: 'મં',
                2: 'બુ',
                3: 'ગુ',
                4: 'શુ',
                5: 'શ',
                6: 'ર',
            },
            'short': {
                0: 'સો',
                1: 'મં',
                2: 'બુ',
                3: 'ગુ',
                4: 'શુ',
                5: 'શ',
                6: 'ર',
            },
            'wide': {
                0: 'સોમવાર',
                1: 'મંગળવાર',
                2: 'બુધવાર',
                3: 'ગુરુવાર',
                4: 'શુક્રવાર',
                5: 'શનિવાર',
                6: 'રવિવાર',
            },
        },
        'months': {
            'abbreviated': {
                1: 'જાન્યુ',
                2: 'ફેબ્રુ',
                3: 'માર્ચ',
                4: 'એપ્રિલ',
                5: 'મે',
                6: 'જૂન',
                7: 'જુલાઈ',
                8: 'ઑગસ્ટ',
                9: 'સપ્ટે',
                10: 'ઑક્ટો',
                11: 'નવે',
                12: 'ડિસે',
            },
            'narrow': {
                1: 'જા',
                2: 'ફે',
                3: 'મા',
                4: 'એ',
                5: 'મે',
                6: 'જૂ',
                7: 'જુ',
                8: 'ઑ',
                9: 'સ',
                10: 'ઑ',
                11: 'ન',
                12: 'ડિ',
            },
            'wide': {
                1: 'જાન્યુઆરી',
                2: 'ફેબ્રુઆરી',
                3: 'માર્ચ',
                4: 'એપ્રિલ',
                5: 'મે',
                6: 'જૂન',
                7: 'જુલાઈ',
                8: 'ઑગસ્ટ',
                9: 'સપ્ટેમ્બર',
                10: 'ઑક્ટોબર',
                11: 'નવેમ્બર',
                12: 'ડિસેમ્બર',
            },
        },
        'units': {
            'year': {
                'one': '{0} વર્ષ',
                'other': '{0} વર્ષ',
            },
            'month': {
                'one': '{0} મહિનો',
                'other': '{0} મહિના',
            },
            'week': {
                'one': '{0} અઠવાડિયું',
                'other': '{0} અઠવાડિયા',
            },
            'day': {
                'one': '{0} દિવસ',
                'other': '{0} દિવસ',
            },
            'hour': {
                'one': '{0} કલાક',
                'other': '{0} કલાક',
            },
            'minute': {
                'one': '{0} મિનિટ',
                'other': '{0} મિનિટ',
            },
            'second': {
                'one': '{0} સેકંડ',
                'other': '{0} સેકંડ',
            },
            'microsecond': {
                'one': '{0} માઇક્રોસેકંડ',
                'other': '{0} માઇક્રોસેકંડ',
            },
        },
        'relative': {
            'year': {
                'future': {
                    'other': '{0} વર્ષમાં',
                    'one': '{0} વર્ષમાં',
                },
                'past': {
                    'other': '{0} વર્ષ પહેલાં',
                    'one': '{0} વર્ષ પહેલાં',
                },
            },
            'month': {
                'future': {
                    'other': '{0} મહિનામાં',
                    'one': '{0} મહિનામાં',
                },
                'past': {
                    'other': '{0} મહિના પહેલાં',
                    'one': '{0} મહિના પહેલાં',
                },
            },
            'week': {
                'future': {
                    'other': '{0} અઠવાડિયામાં',
                    'one': '{0} અઠવાડિયામાં',
                },
                'past': {
                    'other': '{0} અઠવાડિયા પહેલાં',
                    'one': '{0} અઠવાડિયા પહેલાં',
                },
            },
            'day': {
                'future': {
                    'other': '{0} દિવસમાં',
                    'one': '{0} દિવસમાં',
                },
                'past': {
                    'other': '{0} દિવસ પહેલાં',
                    'one': '{0} દિવસ પહેલાં',
                },
            },
            'hour': {
                'future': {
                    'other': '{0} કલાકમાં',
                    'one': '{0} કલાકમાં',
                },
                'past': {
                    'other': '{0} કલાક પહેલાં',
                    'one': '{0} કલાક પહેલાં',
                },
            },
            'minute': {
                'future': {
                    'other': '{0} મિનિટમાં',
                    'one': '{0} મિનિટમાં',
                },
                'past': {
                    'other': '{0} મિનિટ પહેલાં',
                    'one': '{0} મિનિટ પહેલાં',
                },
            },
            'second': {
                'future': {
                    'other': '{0} સેકંડમાં',
                    'one': '{0} સેકંડમાં',
                },
                'past': {
                    'other': '{0} સેકંડ પહેલાં',
                    'one': '{0} સેકંડ પહેલાં',
                },
            },
        },
        'day_periods': {
            "midnight": "મધ્યરાત્રિ",
            "am": "AM",
            "noon": "બપોર",
            "pm": "PM",
            "morning1": "સવારે",
            "afternoon1": "બપોરે",
            "evening1": "સાંજે",
            "night1": "રાત્રે",
        },
        'week_data': {
            'min_days': 1,
            'first_day': 0,
            'weekend_start': 5,
            'weekend_end': 6,
        },
    },
    'custom': custom_translations
}
